{
  "name": "Arthur Chen",
  "contact_title": "Contact",
  "email_label": "Email:",
  "github_label": "GitHub:",
  "nav_home": "Home",
  "nav_about": "About",
  "nav_projects": "Projects",
  "nav_contact": "Contact",
  "tagline": "Aspiring Game Designer | UI/UX Designer | Creative Developer",
  "intro": "Aspiring indie game developer focused on mechanically deep, emotionally resonant gameplay.",
  "about_title": "About Me",
  "about_text": "I'm a passionate game designer and creative developer with a strong foundation in both technical and artistic skills. My international background—having studied in the UK and Japan—gives me a unique perspective on user experience design, allowing me to create engaging interactive experiences that resonate with diverse audiences. I thrive on transforming innovative ideas into polished, user-centered games and applications.",
  "philosophy_title": "Design Philosophy",
  "philosophy_text": "I am an aspiring indie game developer with a strong foundation in technical problem-solving and interactive design. With a background in computer science and game development, I focus on designing mechanically deep gameplay systems where player mastery and emotional progression are closely connected. My international experience studying in the UK and Japan has shaped how I think about player experience and accessibility across cultures. I am now seeking formal training in game and creative design to strengthen my design thinking and move toward creating polished independent games.",
  "creative_title": "Creative Projects",
  "game_projects_subtitle": "Game Design & Development",
  "project1_title": "2D Platformer Adventure",
  "project1_desc": "A comprehensive 2D platformer game developed as my Computer Science A-Level project and refined through continuous development. The game features smooth physics handling, dynamic camera systems, and carefully crafted level design that gradually introduces players to game mechanics while providing challenging explorations with hidden treasures and multiple interactive mechanics.",
  "project1_role": "Role: Lead Programmer & Level Designer",
  "project1_highlight": "Design Highlight: Created an engaging player experience through polished animations, responsive physics, and intuitive level progression that balances accessibility with rewarding challenges and exploration.",
  "project2_title": "Machine Learning Connect 4",
  "project2_desc": "An AI-powered Connect 4 game that uses machine learning algorithms to create an intelligent opponent. The project explores different AI approaches including minimax algorithm with alpha-beta pruning and reinforcement learning techniques to create a challenging and adaptive gameplay experience.",
  "project2_role": "Role: AI Developer & Game Programmer",
  "project2_highlight": "Technical Highlight: Implemented multiple AI strategies with varying difficulty levels, allowing players to experience different challenges while demonstrating practical applications of game theory and machine learning in interactive entertainment.",
  "project3_title": "Procedural Generation Maze",
  "project3_desc": "A dynamic maze generation system that creates unique, solvable labyrinths using procedural algorithms. The project implements various maze generation techniques including recursive backtracking, Prim's algorithm, and depth-first search to create diverse maze layouts with guaranteed solutions and customizable difficulty parameters.",
  "project3_role": "Role: Algorithm Developer & Systems Programmer",
  "project3_highlight": "Design Highlight: Developed an elegant algorithm framework that balances randomness with playability, ensuring every generated maze is both challenging and fair while exploring the intersection of procedural content generation and level design.",
  "screenshots_heading": "Screenshots",
  "skills_title": "Skills & Tools",
  "design_skills": "Design Skills:",
  "design_list": "Game Design • Level Design • UI/UX Design • Player Experience Design",
  "technical_skills": "Technical Skills:",
  "technical_list": "Python • Unity • HTML/CSS/JavaScript • Git/GitHub",
  "artistic_skills": "Artistic Skills:",
  "artistic_list": "Game Animation • Visual Design • Asset Integration",
  "languages_title": "Multilingual Background",
  "languages_subtitle": "Communication & Global Perspective",
  "languages_intro": "My multilingual abilities enable me to understand diverse gaming markets and player perspectives, making me effective at designing for international audiences and collaborating with global teams.",
  "language_native": "Native:",
  "language_native_content": "Chinese (Mandarin)",
  "language_fluent": "Fluent:",
  "language_fluent_content": "English (TOEIC: 990, IELTS: 8.0) | Japanese (JLPT N1, EJU: 356)",
  "language_learning": "Currently Learning:",
  "language_learning_content": "Advanced Japanese (while studying at Kyoto Bunka Japanese Language School)",
  "languages_value": "This linguistic versatility allows me to analyze games from different cultural perspectives and design experiences that transcend language barriers.",
  "inspiration_title": "Influences & Inspirations",
  "inspiration_text": "I draw deep inspiration from indie masterpieces like Cave Story, Undertale, Hollow Knight, and Celeste. These games taught me that compelling experiences come from tight gameplay mechanics, thoughtful level design, and meaningful player agency. Cave Story showed me how solo developers can create expansive worlds with coherent vision. Undertale demonstrated the power of subverting expectations and creating emotional connections through mechanics. Hollow Knight's environmental storytelling and rewarding exploration inspire my approach to level design. Celeste's precise controls and progressive difficulty curves inform how I balance accessibility with challenge.",
  "process_title": "My Creative Process",
  "process_step1": "1. Concept & Theme",
  "process_step1_desc": "I start by identifying the core feeling or experience I want players to have. What should they feel? What should they learn? I explore this through sketches, mood boards, and mechanics brainstorming, ensuring the concept has a clear, focused vision.",
  "process_step2": "2. Design Sketches",
  "process_step2_desc": "I visualize ideas through rapid prototyping on paper and digital mockups. This helps me test spatial layouts, UI flows, and interaction patterns before committing to implementation. Quick iteration at this stage saves significant development time.",
  "process_step3": "3. Mechanics Planning",
  "process_step3_desc": "I design game mechanics by focusing on player feedback and responsiveness. Every mechanic should feel good to execute and serve the core experience. I document mechanics interactions, considering edge cases and how they combine to create emergent gameplay.",
  "process_step4": "4. Prototype & Iterate",
  "process_step4_desc": "I build playable prototypes early to test feel and pacing. Through playtesting and observation, I identify what works and what doesn't, then iterate rapidly. I'm not afraid to cut features that don't serve the core experience, even if they took time to implement.",
  "learning_title": "Currently Learning",
  "learning_text": "I'm actively deepening my Unity skills, studying advanced game design patterns, and exploring shader programming to create unique visual effects. I'm also learning about game economics and progression systems to design more engaging long-term player experiences. Additionally, I'm studying Japanese game design philosophy and development practices to broaden my creative perspective.",
  "resume_title": "Resume",
  "resume_download": "Download Resume",
  "resume_education": "Education",
  "resume_education_content": "Kyoto Bunka Japanese Language School (京都文化日本語学校) — Expected Graduation: March 2026\n\nUK High School — Graduated: June 2022 | A-Levels in Computer Science, Mathematics, and Physics",
  "resume_experience": "Experience",
  "resume_experience_content": "2D Platformer Game Project — Lead Programmer & Level Designer\nDeveloped a comprehensive platformer with polished physics, dynamic camera systems, and progressive level design. Continued refining the project beyond the initial A-Level coursework to implement advanced mechanics and player experience improvements.",
  "resume_achievements": "Achievements",
  "resume_achievements_content": "• TOEIC: 990 (Full Score)\n• IELTS: 8.0\n• JLPT N1 (Japanese Language Proficiency Test)\n• EJU: 356 (Examination for Japanese University Admission)\n• A-Level Computer Science Project: 2D Platformer Game",
  "view_github": "View on GitHub",
  "view_design": "View Design",
  "future_title": "Goals & Vision",
  "future_text": "I aspire to create games that resonate emotionally with players while delivering tight, satisfying gameplay. I'm particularly interested in developing indie-style games that blend challenging mechanics with meaningful narratives and player choice. My goal is to join or contribute to studios that value creative innovation and player-centered design. Long-term, I want to be part of projects that push the boundaries of what games can express and how they make players feel, creating experiences that stay with people long after they've finished playing.",
  "apply_subtitle": "University Applications",
  "apply_hk_title": "Hong Kong Universities",
  "apply_jp_title": "Japanese Universities",
  "apply_polyu_subtitle": "Application Portfolio for Hong Kong Polytechnic University",
  "apply_cityu_subtitle": "Application Portfolio for City University of Hong Kong",
  "apply_kyoto_art_subtitle": "Application Portfolio for Kyoto University of the Arts",
  "apply_kyoto_seika_subtitle": "Application Portfolio for Kyoto Seika University",
  "platformer_title": "2D Platformer Adventure",
  "platformer_preview": "A comprehensive 2D platformer featuring smooth physics, dynamic camera systems, and carefully crafted level design.",
  "platformer_desc": "A comprehensive 2D platformer game developed as my Computer Science A-Level project and refined through continuous development. The game features smooth physics handling, dynamic camera systems, and carefully crafted level design that gradually introduces players to game mechanics while providing challenging explorations with hidden treasures and multiple interactive mechanics.",
  "platformer_role": "Role: Lead Programmer & Level Designer",
  "platformer_highlight": "Design Highlight: Created an engaging player experience through polished animations, responsive physics, and intuitive level progression that balances accessibility with rewarding challenges and exploration.",
  "connect4_title": "Machine Learning Connect 4",
  "connect4_preview": "Exploring how rules and information shape player decision-making.",
  "connect4_desc": "An AI-powered Connect 4 game that uses machine learning algorithms to create an intelligent opponent. The project explores different AI approaches including minimax algorithm with alpha-beta pruning and reinforcement learning techniques to create a challenging and adaptive gameplay experience.",
  "connect4_role": "Role: AI Developer & Game Programmer",
  "connect4_highlight": "Technical Highlight: Implemented multiple AI strategies with varying difficulty levels, allowing players to experience different challenges while demonstrating practical applications of game theory and machine learning in interactive entertainment.",
  "maze_title": "Procedural Generation Maze",
  "maze_preview": "A dynamic maze generation system creating unique, solvable labyrinths using procedural algorithms.",
  "maze_desc": "A dynamic maze generation system that creates unique, solvable labyrinths using procedural algorithms. The project implements various maze generation techniques including recursive backtracking, Prim's algorithm, and depth-first search to create diverse maze layouts with guaranteed solutions and customizable difficulty parameters.",
  "maze_role": "Role: Algorithm Developer & Systems Programmer",
  "maze_highlight": "Design Highlight: Developed an elegant algorithm framework that balances randomness with playability, ensuring every generated maze is both challenging and fair while exploring the intersection of procedural content generation and level design.",
  "view_project": "View Project",
  "back_to_projects": "Back to Projects"
}
