{
  "name": "Arthur Chen",
  "tagline": "Student Game Designer & Creative Developer",
  "contact_title": "Contact",
  "email_label": "Email:",
  "github_label": "GitHub:",
  "nav_home": "Home",
  "nav_about": "About",
  "nav_projects": "Projects",
  "nav_design_thinking": "Design Thinking",
  "intro": "Student game designer focused on mechanically deep gameplay and emotionally resonant player experiences.",
  "philosophy_title": "Design Philosophy",
  "philosophy_text": "I approach game design as a balance between systems and player experience. With a background in computer science and game development, I focus on designing mechanically deep gameplay systems where player mastery and emotional progression are closely connected. My international experience studying in the UK and Japan has shaped how I think about accessibility and cross-cultural player experience. I am now seeking formal training in game and creative design to strengthen my design thinking and develop more polished independent games.",
  "creative_title": "Creative Projects",
  "game_projects_subtitle": "Game Design & Development",
  "platformer_title": "2D Platformer Adventure",
  "platformer_preview": "A comprehensive 2D platformer featuring smooth physics, dynamic camera systems, and carefully crafted level design.",
  "connect4_title": "Machine Learning Connect 4",
  "connect4_preview": "Exploring how rules and information shape player decision-making.",
  "maze_title": "Procedural Generation Maze",
  "maze_preview": "A dynamic maze generation system creating unique, solvable labyrinths using procedural algorithms.",
  "view_all_projects": "View All Projects",
  "screenshots_heading": "Screenshots",
  "view_github": "View on GitHub",
  "about_me_title": "About Me",
  "about_overview_title": "Overview",
  "about_overview_text": "I am an aspiring indie game developer with a background in computer science and a strong focus on gameplay design, systems, and iteration. Through personal game projects, I explore how mechanics, feedback, and constraints shape player experience. I am particularly interested in designing games that feel clear, responsive, and complete, even with limited visual resources.",
  "about_academic_title": "Academic & Technical Background",
  "about_academic_text": "I studied Computer Science, Mathematics, and Physics at A-level, which gave me a strong analytical foundation and comfort with technical problem-solving. I later enrolled in a Computer Science and Artificial Intelligence program, where I further developed my programming skills and understanding of computational systems. This background continues to inform how I approach game development, especially in areas such as system design, logic, and iteration.",
  "about_direction_title": "Clarifying My Direction Through Making",
  "about_direction_text1": "During my university studies, I realized that I was most motivated when building interactive projects rather than conducting theoretical or research-oriented work. While I value the rigor of computer science, I found that my interests aligned more closely with hands-on creation — designing, implementing, testing, and refining experiences that people could directly engage with.",
  "about_direction_text2": "This realization led me to step away from my initial program and focus more intentionally on game creation and design. Rather than viewing this as a departure from my technical background, I see it as a clarification of direction: using programming as a tool to support design goals and player experience.",
  "about_practice_title": "Current Practice",
  "about_practice_intro": "I currently focus on developing small, self-directed game projects, often working as a solo developer. My process emphasizes:",
  "about_practice_list_item1": "Defining a clear core mechanic",
  "about_practice_list_item2": "Prototyping quickly",
  "about_practice_list_item3": "Iterating based on playtesting and observation",
  "about_practice_list_item4": "Prioritizing clarity and responsiveness over visual complexity",
  "about_practice_text": "As someone with limited formal art training, I am especially attentive to how timing, input response, sound, UI, and system feedback can communicate game state and intent. These constraints have shaped how I think about design decisions and scope control in indie development.",
  "about_interests_title": "Design Interests",
  "about_interests_intro": "Through my projects, I am particularly interested in:",
  "about_interests_list_item1": "Teaching mechanics organically through level and system design",
  "about_interests_list_item2": "Designing player feedback without relying on high-fidelity visuals",
  "about_interests_list_item3": "Balancing difficulty through systems rather than numerical tuning alone",
  "about_interests_list_item4": "Managing scope and knowing when to stop adding features in order to finish projects",
  "about_interests_text": "These interests are explored further in my project pages and design reflections.",
  "about_learning_title": "What I Hope to Learn",
  "about_learning_text": "I am seeking formal education in game design to strengthen my design fundamentals, receive structured critique, and learn from peers with diverse creative backgrounds. I hope to deepen my understanding of design theory, iteration, and collaboration, while continuing to develop as a creator capable of bringing complete game experiences from concept to execution.",
  "skills_title": "Skills & Tools",
  "design_skills": "Design Skills:",
  "design_list": "Game Design • Level Design • UI/UX Design • Player Experience Design",
  "technical_skills": "Technical Skills:",
  "technical_list": "Python • Unity • HTML/CSS/JavaScript • Git/GitHub",
  "artistic_skills": "Artistic Skills:",
  "artistic_list": "Game Animation • Visual Design • Asset Integration",
  "languages_title": "Multilingual Background",
  "languages_subtitle": "Communication & Global Perspective",
  "languages_intro": "My multilingual abilities enable me to understand diverse gaming markets and player perspectives, making me effective at designing for international audiences and collaborating with global teams.",
  "language_native": "Native:",
  "language_native_content": "Chinese (Mandarin)",
  "language_fluent": "Fluent:",
  "language_fluent_content": "English (TOEIC: 990, IELTS: 8.0) | Japanese (JLPT N1, EJU: 356)",
  "language_learning": "Currently Learning:",
  "language_learning_content": "Advanced Japanese (while studying at Kyoto Bunka Japanese Language School)",
  "languages_value": "This linguistic versatility allows me to analyze games from different cultural perspectives and design experiences that transcend language barriers.",
  "projects_design_studies_subtitle": "Design Studies",
  "view_project": "View Project",
  "back_to_projects": "Back to Projects",
  "design_reflections_title": "Design Reflections",
  "design_reflections_intro": "This page documents key design decisions from my game projects, focusing on the thought process behind mechanical choices, iteration patterns, and lessons learned through development.",
  "design_combat_title": "Context-Based Combat",
  "design_combat_context": "Context: In my platformer, I initially planned a traditional combat system with dedicated attack buttons and health bars.",
  "design_combat_decision": "Decision: I shifted to environmental interaction instead—enemies are defeated by jumping on them or using level hazards, similar to classic platformers.",
  "design_combat_result": "Result: This kept the focus on movement and platforming skill rather than combat timing, reinforcing the core mechanic.",
  "design_combat_insight": "Insight: Not every mechanic needs to be innovative. Sometimes reinforcing genre conventions helps players feel comfortable and focus on what makes your game unique.",
  "design_physics_title": "Physics Tuning by Feel",
  "design_physics_context": "Context: Early player movement felt floaty and unresponsive, even with realistic physics values.",
  "design_physics_decision": "Decision: I prioritized 'game feel' over realism—tightening jump arcs, increasing gravity, and adding coyote time for late jumps.",
  "design_physics_result": "Result: Players reported the movement felt 'snappy' and 'satisfying,' even though it was physically unrealistic.",
  "design_physics_insight": "Insight: Players don't experience numbers—they experience feel. Tuning for player satisfaction often means breaking physical accuracy.",
  "design_camera_title": "Camera System Evolution",
  "design_camera_context": "Context: My initial camera simply followed the player's position directly.",
  "design_camera_decision": "Decision: I implemented lookahead (camera shifts based on player direction) and smoothing to reduce jarring movements.",
  "design_camera_result": "Result: Players could see more of what's ahead, reducing unfair deaths from off-screen obstacles.",
  "design_camera_insight": "Insight: Good camera work is invisible. Players only notice when it's bad. Small adjustments to anticipation and smoothing make exploration feel natural.",
  "apply_subtitle": "University Applications",
  "apply_hk_title": "Hong Kong Universities",
  "apply_jp_title": "Japanese Universities",
  "apply_polyu_subtitle": "Application Portfolio for Hong Kong Polytechnic University",
  "apply_cityu_subtitle": "Application Portfolio for City University of Hong Kong",
  "apply_kyoto_art_subtitle": "Application Portfolio for Kyoto University of the Arts",
  "apply_kyoto_seika_subtitle": "Application Portfolio for Kyoto Seika University",
  "project_english_note": "This project case study is presented in English to preserve design and technical nuance.",
  "return_to_application": "← Back to Application Page"
}
