{
  "name": "Arthur Chen",
  "contact_title": "Contact",
  "email_label": "Email:",
  "github_label": "GitHub:",
  "nav_home": "Home",
  "nav_about": "About",
  "nav_projects": "Projects",
  "nav_contact": "Contact",
  "tagline": "Aspiring Game Designer | UI/UX Designer | Creative Developer",
  "intro": "Aspiring indie game developer focused on mechanically deep, emotionally resonant gameplay.",
  "about_title": "About Me",
  "about_text": "I'm a passionate game designer and creative developer with a strong foundation in both technical and artistic skills. My international background—having studied in the UK and Japan—gives me a unique perspective on user experience design, allowing me to create engaging interactive experiences that resonate with diverse audiences. I thrive on transforming innovative ideas into polished, user-centered games and applications.",
  "philosophy_title": "Design Philosophy",
  "philosophy_text": "I am an aspiring indie game developer with a strong foundation in technical problem-solving and interactive design. With a background in computer science and game development, I focus on designing mechanically deep gameplay systems where player mastery and emotional progression are closely connected. My international experience studying in the UK and Japan has shaped how I think about player experience and accessibility across cultures. I am now seeking formal training in game and creative design to strengthen my design thinking and move toward creating polished independent games.",
  "creative_title": "Creative Projects",
  "game_projects_subtitle": "Game Design & Development",
  "project1_title": "2D Platformer Adventure",
  "project1_desc": "A comprehensive 2D platformer game developed as my Computer Science A-Level project and refined through continuous development. The game features smooth physics handling, dynamic camera systems, and carefully crafted level design that gradually introduces players to game mechanics while providing challenging explorations with hidden treasures and multiple interactive mechanics.",
  "project1_role": "Role: Lead Programmer & Level Designer",
  "project1_highlight": "Design Highlight: Created an engaging player experience through polished animations, responsive physics, and intuitive level progression that balances accessibility with rewarding challenges and exploration.",
  "project2_title": "Machine Learning Connect 4",
  "project2_desc": "An AI-powered Connect 4 game that uses machine learning algorithms to create an intelligent opponent. The project explores different AI approaches including minimax algorithm with alpha-beta pruning and reinforcement learning techniques to create a challenging and adaptive gameplay experience.",
  "project2_role": "Role: AI Developer & Game Programmer",
  "project2_highlight": "Technical Highlight: Implemented multiple AI strategies with varying difficulty levels, allowing players to experience different challenges while demonstrating practical applications of game theory and machine learning in interactive entertainment.",
  "project3_title": "Procedural Generation Maze",
  "project3_desc": "A dynamic maze generation system that creates unique, solvable labyrinths using procedural algorithms. The project implements various maze generation techniques including recursive backtracking, Prim's algorithm, and depth-first search to create diverse maze layouts with guaranteed solutions and customizable difficulty parameters.",
  "project3_role": "Role: Algorithm Developer & Systems Programmer",
  "project3_highlight": "Design Highlight: Developed an elegant algorithm framework that balances randomness with playability, ensuring every generated maze is both challenging and fair while exploring the intersection of procedural content generation and level design.",
  "screenshots_heading": "Screenshots",
  "skills_title": "Skills & Tools",
  "design_skills": "Design Skills:",
  "design_list": "Game Design • Level Design • UI/UX Design • Player Experience Design",
  "technical_skills": "Technical Skills:",
  "technical_list": "Python • Unity • HTML/CSS/JavaScript • Git/GitHub",
  "artistic_skills": "Artistic Skills:",
  "artistic_list": "Game Animation • Visual Design • Asset Integration",
  "languages_title": "Multilingual Background",
  "languages_subtitle": "Communication & Global Perspective",
  "languages_intro": "My multilingual abilities enable me to understand diverse gaming markets and player perspectives, making me effective at designing for international audiences and collaborating with global teams.",
  "language_native": "Native:",
  "language_native_content": "Chinese (Mandarin)",
  "language_fluent": "Fluent:",
  "language_fluent_content": "English (TOEIC: 990, IELTS: 8.0) | Japanese (JLPT N1, EJU: 356)",
  "language_learning": "Currently Learning:",
  "language_learning_content": "Advanced Japanese (while studying at Kyoto Bunka Japanese Language School)",
  "languages_value": "This linguistic versatility allows me to analyze games from different cultural perspectives and design experiences that transcend language barriers.",
  "inspiration_title": "Influences & Inspirations",
  "inspiration_text": "I draw deep inspiration from indie masterpieces like Cave Story, Undertale, Hollow Knight, and Celeste. These games taught me that compelling experiences come from tight gameplay mechanics, thoughtful level design, and meaningful player agency. Cave Story showed me how solo developers can create expansive worlds with coherent vision. Undertale demonstrated the power of subverting expectations and creating emotional connections through mechanics. Hollow Knight's environmental storytelling and rewarding exploration inspire my approach to level design. Celeste's precise controls and progressive difficulty curves inform how I balance accessibility with challenge.",
  "process_title": "My Creative Process",
  "process_step1": "1. Concept & Theme",
  "process_step1_desc": "I start by identifying the core feeling or experience I want players to have. What should they feel? What should they learn? I explore this through sketches, mood boards, and mechanics brainstorming, ensuring the concept has a clear, focused vision.",
  "process_step2": "2. Design Sketches",
  "process_step2_desc": "I visualize ideas through rapid prototyping on paper and digital mockups. This helps me test spatial layouts, UI flows, and interaction patterns before committing to implementation. Quick iteration at this stage saves significant development time.",
  "process_step3": "3. Mechanics Planning",
  "process_step3_desc": "I design game mechanics by focusing on player feedback and responsiveness. Every mechanic should feel good to execute and serve the core experience. I document mechanics interactions, considering edge cases and how they combine to create emergent gameplay.",
  "process_step4": "4. Prototype & Iterate",
  "process_step4_desc": "I build playable prototypes early to test feel and pacing. Through playtesting and observation, I identify what works and what doesn't, then iterate rapidly. I'm not afraid to cut features that don't serve the core experience, even if they took time to implement.",
  "learning_title": "Currently Learning",
  "learning_text": "I'm actively deepening my Unity skills, studying advanced game design patterns, and exploring shader programming to create unique visual effects. I'm also learning about game economics and progression systems to design more engaging long-term player experiences. Additionally, I'm studying Japanese game design philosophy and development practices to broaden my creative perspective.",
  "resume_title": "Resume",
  "resume_download": "Download Resume",
  "resume_education": "Education",
  "resume_education_content": "Kyoto Bunka Japanese Language School (京都文化日本語学校) — Expected Graduation: March 2026\n\nUK High School — Graduated: June 2022 | A-Levels in Computer Science, Mathematics, and Physics",
  "resume_experience": "Experience",
  "resume_experience_content": "2D Platformer Game Project — Lead Programmer & Level Designer\nDeveloped a comprehensive platformer with polished physics, dynamic camera systems, and progressive level design. Continued refining the project beyond the initial A-Level coursework to implement advanced mechanics and player experience improvements.",
  "resume_achievements": "Achievements",
  "resume_achievements_content": "• TOEIC: 990 (Full Score)\n• IELTS: 8.0\n• JLPT N1 (Japanese Language Proficiency Test)\n• EJU: 356 (Examination for Japanese University Admission)\n• A-Level Computer Science Project: 2D Platformer Game",
  "view_github": "View on GitHub",
  "view_design": "View Design",
  "future_title": "Goals & Vision",
  "future_text": "I aspire to create games that resonate emotionally with players while delivering tight, satisfying gameplay. I'm particularly interested in developing indie-style games that blend challenging mechanics with meaningful narratives and player choice. My goal is to join or contribute to studios that value creative innovation and player-centered design. Long-term, I want to be part of projects that push the boundaries of what games can express and how they make players feel, creating experiences that stay with people long after they've finished playing.",
  "apply_subtitle": "University Applications",
  "apply_hk_title": "Hong Kong Universities",
  "apply_jp_title": "Japanese Universities",
  "apply_polyu_subtitle": "Application Portfolio for Hong Kong Polytechnic University",
  "apply_cityu_subtitle": "Application Portfolio for City University of Hong Kong",
  "apply_kyoto_art_subtitle": "Application Portfolio for Kyoto University of the Arts",
  "apply_kyoto_seika_subtitle": "Application Portfolio for Kyoto Seika University",
  "platformer_title": "2D Platformer Adventure",
  "platformer_preview": "A comprehensive 2D platformer featuring smooth physics, dynamic camera systems, and carefully crafted level design.",
  "platformer_desc": "A comprehensive 2D platformer game developed as my Computer Science A-Level project and refined through continuous development. The game features smooth physics handling, dynamic camera systems, and carefully crafted level design that gradually introduces players to game mechanics while providing challenging explorations with hidden treasures and multiple interactive mechanics.",
  "platformer_role": "Role: Lead Programmer & Level Designer",
  "platformer_highlight": "Design Highlight: Created an engaging player experience through polished animations, responsive physics, and intuitive level progression that balances accessibility with rewarding challenges and exploration.",
  "connect4_title": "Machine Learning Connect 4",
  "connect4_preview": "Exploring how rules and information shape player decision-making.",
  "connect4_desc": "An AI-powered Connect 4 game that uses machine learning algorithms to create an intelligent opponent. The project explores different AI approaches including minimax algorithm with alpha-beta pruning and reinforcement learning techniques to create a challenging and adaptive gameplay experience.",
  "connect4_role": "Role: AI Developer & Game Programmer",
  "connect4_highlight": "Technical Highlight: Implemented multiple AI strategies with varying difficulty levels, allowing players to experience different challenges while demonstrating practical applications of game theory and machine learning in interactive entertainment.",
  "maze_title": "Procedural Generation Maze",
  "maze_preview": "A dynamic maze generation system creating unique, solvable labyrinths using procedural algorithms.",
  "maze_desc": "A dynamic maze generation system that creates unique, solvable labyrinths using procedural algorithms. The project implements various maze generation techniques including recursive backtracking, Prim's algorithm, and depth-first search to create diverse maze layouts with guaranteed solutions and customizable difficulty parameters.",
  "maze_role": "Role: Algorithm Developer & Systems Programmer",
  "maze_highlight": "Design Highlight: Developed an elegant algorithm framework that balances randomness with playability, ensuring every generated maze is both challenging and fair while exploring the intersection of procedural content generation and level design.",
  "view_project": "View Project",
  "back_to_projects": "Back to Projects",
  "nav_design_thinking": "Design Thinking",
  "view_all_projects": "View All Projects",
  "about_me_title": "About Me",
  "about_overview_title": "Overview",
  "about_overview_text": "I am an aspiring indie game developer with a background in computer science and a strong focus on gameplay design, systems, and iteration. Through personal game projects, I explore how mechanics, feedback, and constraints shape player experience. I am particularly interested in designing games that feel clear, responsive, and complete, even with limited visual resources.",
  "about_academic_title": "Academic & Technical Background",
  "about_academic_text": "I studied Computer Science, Mathematics, and Physics at A-level, which gave me a strong analytical foundation and comfort with technical problem-solving. I later enrolled in a Computer Science and Artificial Intelligence program, where I further developed my programming skills and understanding of computational systems. This background continues to inform how I approach game development, especially in areas such as system design, logic, and iteration.",
  "about_direction_title": "Clarifying My Direction Through Making",
  "about_direction_text1": "During my university studies, I realized that I was most motivated when building interactive projects rather than conducting theoretical or research-oriented work. While I value the rigor of computer science, I found that my interests aligned more closely with hands-on creation — designing, implementing, testing, and refining experiences that people could directly engage with.",
  "about_direction_text2": "This realization led me to step away from my initial program and focus more intentionally on game creation and design. Rather than viewing this as a departure from my technical background, I see it as a clarification of direction: using programming as a tool to support design goals and player experience.",
  "about_practice_title": "Current Practice",
  "about_practice_intro": "I currently focus on developing small, self-directed game projects, often working as a solo developer. My process emphasizes:",
  "about_practice_list_item1": "Defining a clear core mechanic",
  "about_practice_list_item2": "Prototyping quickly",
  "about_practice_list_item3": "Iterating based on playtesting and observation",
  "about_practice_list_item4": "Prioritizing clarity and responsiveness over visual complexity",
  "about_practice_text": "As someone with limited formal art training, I am especially attentive to how timing, input response, sound, UI, and system feedback can communicate game state and intent. These constraints have shaped how I think about design decisions and scope control in indie development.",
  "about_interests_title": "Design Interests",
  "about_interests_intro": "Through my projects, I am particularly interested in:",
  "about_interests_list_item1": "Teaching mechanics organically through level and system design",
  "about_interests_list_item2": "Designing player feedback without relying on high-fidelity visuals",
  "about_interests_list_item3": "Balancing difficulty through systems rather than numerical tuning alone",
  "about_interests_list_item4": "Managing scope and knowing when to stop adding features in order to finish projects",
  "about_interests_text": "These interests are explored further in my project pages and design reflections.",
  "about_learning_title": "What I Hope to Learn",
  "about_learning_text": "I am seeking formal education in game design to strengthen my design fundamentals, receive structured critique, and learn from peers with diverse creative backgrounds. I hope to deepen my understanding of design theory, iteration, and collaboration, while continuing to develop as a creator capable of bringing complete game experiences from concept to execution.",
  "projects_design_studies_subtitle": "Design Studies",
  "design_reflections_title": "Design Reflections",
  "design_reflections_intro": "This page documents key design decisions from my game projects, focusing on the thought process behind mechanical choices, iteration patterns, and lessons learned through development.",
  "design_combat_title": "Context-Based Combat",
  "design_combat_context": "Context: In my platformer, I initially planned a traditional combat system with dedicated attack buttons and health bars.",
  "design_combat_decision": "Decision: I shifted to environmental interaction instead—enemies are defeated by jumping on them or using level hazards, similar to classic platformers.",
  "design_combat_result": "Result: This kept the focus on movement and platforming skill rather than combat timing, reinforcing the core mechanic.",
  "design_combat_insight": "Insight: Not every mechanic needs to be innovative. Sometimes reinforcing genre conventions helps players feel comfortable and focus on what makes your game unique.",
  "design_physics_title": "Physics Tuning by Feel",
  "design_physics_context": "Context: Early player movement felt floaty and unresponsive, even with realistic physics values.",
  "design_physics_decision": "Decision: I prioritized 'game feel' over realism—tightening jump arcs, increasing gravity, and adding coyote time for late jumps.",
  "design_physics_result": "Result: Players reported the movement felt 'snappy' and 'satisfying,' even though it was physically unrealistic.",
  "design_physics_insight": "Insight: Players don't experience numbers—they experience feel. Tuning for player satisfaction often means breaking physical accuracy.",
  "design_camera_title": "Camera System Evolution",
  "design_camera_context": "Context: My initial camera simply followed the player's position directly.",
  "design_camera_decision": "Decision: I implemented lookahead (camera shifts based on player direction) and smoothing to reduce jarring movements.",
  "design_camera_result": "Result: Players could see more of what's ahead, reducing unfair deaths from off-screen obstacles.",
  "design_camera_insight": "Insight: Good camera work is invisible. Players only notice when it's bad. Small adjustments to anticipation and smoothing make exploration feel natural.",
  "apply_polyu_title": "PolyU - Hong Kong Polytechnic University",
  "apply_cityu_title": "CityU - City University of Hong Kong",
  "apply_kyoto_art_title": "Kyoto University of the Arts",
  "apply_kyoto_seika_title": "Kyoto Seika University",
  "apply_view_portfolio": "View Application Portfolio",
  "back_to_applications": "Back to Applications",
  "apply_polyu_content": "I am applying to PolyU's BA (Hons) Scheme in Design because I am drawn to its emphasis on human-centered design thinking and its integration of technical execution with conceptual development. My background in computer science and hands-on game development has taught me to think systematically about how people interact with designed systems, but I recognize that I need structured training in design fundamentals—user research, iteration frameworks, and creative critique—to grow beyond purely technical problem-solving. PolyU's approach aligns with how I already work: prototyping quickly, testing with real users, and refining based on feedback. I want to formalize this intuition and learn to articulate my design decisions with clarity and purpose.",
  "apply_cityu_content": "I am applying to CityU because I see creative practice as inseparable from making. My game projects have taught me that design clarity comes from building, testing, and iterating—not just planning. CityU's focus on hands-on studio work and interdisciplinary collaboration resonates with how I approach problems: by prototyping early, gathering feedback, and refining through direct engagement. I am particularly interested in learning how to balance artistic vision with user experience, and how to critique my own work objectively while maintaining creative intent.",
  "apply_kyoto_art_content": "京都芸術大学のゲームデザインコースに応募する理由は、ゲームを単なる技術的な実装ではなく、総合的な表現手段として捉える教育方針に共感したからです。私はこれまで独学でゲーム開発を続けてきましたが、デザイン理論や批評的思考の訓練が不足していることを痛感しています。京都芸術大学では、技術とアートとデザインを統合的に学べる環境があり、自分の制作実践をより深く理解し、言語化する力を養いたいと考えています。",
  "apply_kyoto_seika_content": "京都精華大学のデジタルクリエイションコースに応募する理由は、独立系ゲーム開発者として必要なデザイン基礎力を体系的に学びたいからです。私はこれまでプログラミングと独学での制作を中心に活動してきましたが、視覚表現や体験設計における理論的な裏付けが不足していると感じています。京都精華大学の実践的なカリキュラムと批評文化の中で、自分の制作を客観的に見つめ直し、完成度の高い作品を作り上げる力を身につけたいと考えています。"
}
