{
  "shared": {
    "name": "Arthur Chen",
    "contact_title": "Contact",
    "email_label": "Email:",
    "github_label": "GitHub:",
    "nav_about": "About",
    "nav_philosophy": "Philosophy",
    "nav_languages": "Languages",
    "nav_projects": "Projects",
    "nav_ui_study": "UI/UX",
    "nav_process": "Process",
    "nav_skills": "Skills",
    "nav_resume": "Resume",
    "nav_contact": "Contact"
  },
  "home": {
    "tagline": "Aspiring Game Designer | Creative Storyteller",
    "intro": "Welcome to my portfolio. I'm passionate about game design, UI/UX, and creating meaningful interactive experiences."
  },
  "hongkong": {
    "tagline": "Aspiring Game Designer | UI/UX Designer | Creative Developer",
    "about_title": "About Me",
    "about_text": "I'm a passionate game designer and creative developer with a strong foundation in both technical and artistic skills. My international background—having studied in the UK and Japan—gives me a unique perspective on user experience design, allowing me to create engaging interactive experiences that resonate with diverse audiences. I thrive on transforming innovative ideas into polished, user-centered games and applications.",
    "philosophy_title": "Design Philosophy",
    "philosophy_text": "Great design puts the player first. I believe in creating intuitive, meaningful experiences that balance engaging gameplay with clear visual communication. My approach combines data-driven decision-making with creative innovation, ensuring every design choice serves both the user's needs and the project's goals.",
    "creative_title": "Creative Projects",
    "game_projects_subtitle": "Game Design & Development",
    "project1_title": "2D Platformer Adventure",
    "project1_desc": "A comprehensive 2D platformer game developed as my Computer Science A-Level project and refined through continuous development. The game features smooth physics handling, dynamic camera systems, and carefully crafted level design that gradually introduces players to game mechanics while providing challenging explorations with hidden treasures and multiple interactive mechanics.",
    "project1_role": "Role: Lead Programmer & Level Designer",
    "project1_highlight": "Design Highlight: Created an engaging player experience through polished animations, responsive physics, and intuitive level progression that balances accessibility with rewarding challenges and exploration.",
    "art_projects_subtitle": "Visual & Concept Work",
    "art_note": "[Showcase your visual art skills and concept work - emphasize versatility and creative range]",
    "ui_study_title": "UI/UX Design Studies",
    "ui_study_subtitle": "Game Interface Analysis & Design",
    "ui_study_intro": "Through analyzing successful game interfaces, I've developed a keen eye for effective UI/UX patterns and player-centered design principles.",
    "ui_study1_title": "[Game Title or UI Study Name]",
    "ui_study1_desc": "[Describe your analysis - what makes this UI successful? What design principles did you identify and apply?]",
    "ui_study2_title": "[Another UI Study]",
    "ui_study2_desc": "[Another analysis focusing on different UI aspects or design challenges]",
    "skills_title": "Skills & Tools",
    "design_skills": "Design Skills:",
    "design_list": "Game Design • Level Design • UI/UX Design • Player Experience Design",
    "technical_skills": "Technical Skills:",
    "technical_list": "Python • Unity • HTML/CSS/JavaScript • Git/GitHub",
    "artistic_skills": "Artistic Skills:",
    "artistic_list": "Game Animation • Visual Design • Asset Integration",
    "languages_title": "Multilingual Background",
    "languages_subtitle": "Communication & Global Perspective",
    "languages_intro": "My multilingual abilities enable me to understand diverse gaming markets and player perspectives, making me effective at designing for international audiences and collaborating with global teams.",
    "language_native": "Native:",
    "language_native_content": "Chinese (Mandarin)",
    "language_fluent": "Fluent:",
    "language_fluent_content": "English (TOEIC: 990, IELTS: 8.0) | Japanese (JLPT N1, EJU: 356)",
    "language_learning": "Currently Learning:",
    "language_learning_content": "Advanced Japanese (while studying at Kyoto Bunka Japanese Language School)",
    "languages_value": "This linguistic versatility allows me to analyze games from different cultural perspectives and design experiences that transcend language barriers.",
    "inspiration_title": "Influences & Inspirations",
    "inspiration_text": "I draw deep inspiration from indie masterpieces like Cave Story, Undertale, Hollow Knight, and Celeste. These games taught me that compelling experiences come from tight gameplay mechanics, thoughtful level design, and meaningful player agency. Cave Story showed me how solo developers can create expansive worlds with coherent vision. Undertale demonstrated the power of subverting expectations and creating emotional connections through mechanics. Hollow Knight's environmental storytelling and rewarding exploration inspire my approach to level design. Celeste's precise controls and progressive difficulty curves inform how I balance accessibility with challenge.",
    "process_title": "My Creative Process",
    "process_step1": "1. Concept & Theme",
    "process_step1_desc": "I start by identifying the core feeling or experience I want players to have. What should they feel? What should they learn? I explore this through sketches, mood boards, and mechanics brainstorming, ensuring the concept has a clear, focused vision.",
    "process_step2": "2. Design Sketches",
    "process_step2_desc": "I visualize ideas through rapid prototyping on paper and digital mockups. This helps me test spatial layouts, UI flows, and interaction patterns before committing to implementation. Quick iteration at this stage saves significant development time.",
    "process_step3": "3. Mechanics Planning",
    "process_step3_desc": "I design game mechanics by focusing on player feedback and responsiveness. Every mechanic should feel good to execute and serve the core experience. I document mechanics interactions, considering edge cases and how they combine to create emergent gameplay.",
    "process_step4": "4. Prototype & Iterate",
    "process_step4_desc": "I build playable prototypes early to test feel and pacing. Through playtesting and observation, I identify what works and what doesn't, then iterate rapidly. I'm not afraid to cut features that don't serve the core experience, even if they took time to implement.",
    "learning_title": "Currently Learning",
    "learning_text": "I'm actively deepening my Unity skills, studying advanced game design patterns, and exploring shader programming to create unique visual effects. I'm also learning about game economics and progression systems to design more engaging long-term player experiences. Additionally, I'm studying Japanese game design philosophy and development practices to broaden my creative perspective.",
    "resume_title": "Resume",
    "resume_download": "Download Resume",
    "resume_education": "Education",
    "resume_education_content": "Kyoto Bunka Japanese Language School (京都文化日本語学校) — Expected Graduation: March 2026\n\nUK High School — Graduated: June 2022 | A-Levels in Computer Science, Mathematics, and Physics",
    "resume_experience": "Experience",
    "resume_experience_content": "2D Platformer Game Project — Lead Programmer & Level Designer\nDeveloped a comprehensive platformer with polished physics, dynamic camera systems, and progressive level design. Continued refining the project beyond the initial A-Level coursework to implement advanced mechanics and player experience improvements.",
    "resume_achievements": "Achievements",
    "resume_achievements_content": "• TOEIC: 990 (Full Score)\n• IELTS: 8.0\n• JLPT N1 (Japanese Language Proficiency Test)\n• EJU: 356 (Examination for Japanese University Admission)\n• A-Level Computer Science Project: 2D Platformer Game",
    "view_github": "View on GitHub",
    "view_design": "View Design",
    "future_title": "Goals & Vision",
    "future_text": "I aspire to create games that resonate emotionally with players while delivering tight, satisfying gameplay. I'm particularly interested in developing indie-style games that blend challenging mechanics with meaningful narratives and player choice. My goal is to join or contribute to studios that value creative innovation and player-centered design. Long-term, I want to be part of projects that push the boundaries of what games can express and how they make players feel, creating experiences that stay with people long after they've finished playing."
  },
  "japan": {
    "tagline": "Game Design Aspirant | Creative Storyteller",
    "about_title": "About Me",
    "about_text": "I am passionate about game design and creating interactive experiences. Drawing from my multicultural background—having studied in the UK and currently in Japan—I approach user experience from diverse perspectives. I continue to learn from both technical and artistic aspects, striving to create better work.",
    "philosophy_title": "Design Philosophy",
    "philosophy_text": "I believe great design grows together with players. I value creating intuitive and meaningful experiences, cherishing the harmony between gameplay and visual communication. I emphasize teamwork and strive for designs that stay close to users' needs.",
    "creative_title": "Creative Projects",
    "game_projects_subtitle": "Game Design & Development",
    "project1_title": "2D Platformer Project",
    "project1_desc": "A 2D platformer game initially created for my Computer Science A-Level project. Through this project, I learned the importance of player experience, facing challenges in physics implementation, animation systems, and level design. I continued development after completing the coursework, working to improve the gradual introduction of mechanics, exploration elements, and overall player engagement.",
    "project1_role": "Role: Programming & Level Design",
    "project1_highlight": "Key Learning: Understanding how to balance accessibility with challenge through iterative level design and the importance of responsive controls and visual feedback for player satisfaction.",
    "art_projects_subtitle": "Visual & Concept Work",
    "art_note": "[Showcase your visual art skills and concept work - emphasize versatility and creative range]",
    "ui_study_title": "UI/UX Design Studies",
    "ui_study_subtitle": "Game Interface Analysis & Design",
    "ui_study_intro": "By studying excellent game interfaces, I am learning about effective UI/UX patterns and player-centered design principles.",
    "ui_study1_title": "[Game Title or UI Study Name]",
    "ui_study1_desc": "[Analysis content - what you learned from this UI, what design principles you discovered]",
    "ui_study2_title": "[Another UI Study]",
    "ui_study2_desc": "[Another analysis - focusing on different UI elements or design challenges]",
    "skills_title": "Skills & Tools",
    "design_skills": "Design Skills:",
    "design_list": "Game Design • Level Design • UI/UX Design • Player Experience Design",
    "technical_skills": "Technical Skills:",
    "technical_list": "Python • Unity • HTML/CSS/JavaScript • Git/GitHub",
    "artistic_skills": "Artistic Skills:",
    "artistic_list": "Game Animation • Visual Design • Asset Integration",
    "languages_title": "Multilingual Background",
    "languages_subtitle": "Communication & Cultural Understanding",
    "languages_intro": "Through my multilingual abilities, I understand different cultures and values, cherishing collaboration in global team environments.",
    "language_native": "Native:",
    "language_native_content": "Chinese (Mandarin)",
    "language_fluent": "Fluent:",
    "language_fluent_content": "English (TOEIC: 990, IELTS: 8.0) | Japanese (JLPT N1, EJU: 356)",
    "language_learning": "Currently Learning:",
    "language_learning_content": "Advanced Japanese (while studying at Kyoto Bunka Japanese Language School)",
    "languages_value": "Through language, I aim to analyze games from various cultural perspectives and design experiences that transcend language barriers.",
    "inspiration_title": "Influences & Inspirations",
    "inspiration_text": "I have learned much from indie games like Cave Story, Undertale, Hollow Knight, and Celeste. From Cave Story, I learned how one person's clear vision can create a cohesive world. Undertale taught me about creating emotional connections through game mechanics and respecting player choice. Hollow Knight showed me the value of environmental storytelling and rewarding exploration. Celeste demonstrated how to make controls feel responsive while creating fair, challenging experiences. I continue to study these games to improve my understanding of what makes players feel engaged and satisfied.",
    "process_title": "Creative Process",
    "process_step1": "1. Concept & Theme",
    "process_step1_desc": "I begin by considering what experience I want to create for players. Through sketching and research, I work to develop ideas that have clear focus. I value feedback at this early stage to ensure my direction is sound.",
    "process_step2": "2. Design Sketches",
    "process_step2_desc": "I create simple prototypes on paper and digital tools to visualize ideas before implementation. This helps me identify potential issues early and learn what works through low-cost experimentation.",
    "process_step3": "3. Mechanics Design",
    "process_step3_desc": "I focus on making mechanics feel responsive and intuitive. I study how mechanics interact with each other and document my findings. Through this process, I'm learning to anticipate player behavior and design accordingly.",
    "process_step4": "4. Prototype & Refinement",
    "process_step4_desc": "I build simple playable versions to test my ideas. Through observation and testing, I identify areas for improvement and iterate. I'm learning to accept feedback constructively and make difficult decisions about cutting features when necessary.",
    "learning_title": "Currently Learning",
    "learning_text": "I am working to deepen my Unity knowledge and studying game design patterns to improve my skills. I'm also learning about shader programming and visual effects. Additionally, I'm studying game design philosophy and development practices, particularly from Japanese game developers, to broaden my perspective and grow as a designer.",
    "resume_title": "Resume",
    "resume_download": "Download Resume",
    "resume_education": "Education",
    "resume_education_content": "Kyoto Bunka Japanese Language School (京都文化日本語学校) — Expected Graduation: March 2026\n\nUK High School — Graduated: June 2022 | A-Levels in Computer Science, Mathematics, and Physics",
    "resume_experience": "Experience",
    "resume_experience_content": "2D Platformer Game Project — Programming & Level Design\nCreated as a Computer Science A-Level project and continued development afterward. Through this project, I learned about physics systems, animation implementation, dynamic camera systems, and player-centered level design. Focused on creating progressive difficulty curves and engaging exploration elements.",
    "resume_achievements": "Achievements",
    "resume_achievements_content": "• TOEIC: 990 (Full Score)\n• IELTS: 8.0\n• JLPT N1 (Japanese Language Proficiency Test)\n• EJU: 356 (Examination for Japanese University Admission)\n• A-Level Computer Science Project: 2D Platformer Game",
    "view_github": "View on GitHub",
    "view_design": "View Design",
    "future_title": "Goals & Vision",
    "future_text": "I hope to create games that connect with players emotionally while providing satisfying gameplay experiences. I am particularly interested in indie-style games that combine thoughtful mechanics with meaningful stories. I aspire to work with teams that value creativity and player-focused design, where I can continue learning and contributing. Through my work, I hope to create experiences that resonate with players and contribute positively to the game development community."
  }
}
